# 예제 - 삽입
nums = [n for n in range(1,11)]
print(nums)
""" 💻실행 결과
[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
"""

nums.append(55)
nums.insert(2,77)
print(nums)
""" 💻실행 결과
[1, 2, 77, 3, 4, 5, 6, 7, 8, 9, 10, 55]
"""

nums[2:2] = [23, 24, 25]
print(nums)
""" 💻실행 결과
[1, 2, 23, 24, 25, 77, 3, 4, 5, 6, 7, 8, 9, 10, 55]
"""

nums[3] = [31, 32]
print(nums)
""" 💻실행 결과
[1, 2, 23, [31, 32], 25, 77, 3, 4, 5, 6, 7, 8, 9, 10, 55]
"""

nums2 = [n * 5 for n in range(1,3)]
print(nums2)
""" 💻실행 결과
[5, 10]
"""

nums2.extend(nums)
print(nums2)
""" 💻실행 결과
[5, 10, 1, 2, 23, [31, 32], 25, 77, 3, 4, 5, 6, 7, 8, 9, 10, 55]
"""